yybhdx/STM32_Standard_Peripheral_Library_Study_Notes/6-2 定时器外部时钟(对射式红外传感器作为ETR(定时器的时钟源))/System/Timer.c
#include "stm32f10x.h"                  // Device header

extern uint16_t Num;
/**
  * 函    数：定时中断初始化
  * 参    数：无
  * 返 回 值：无
  */
void Timer_Init(void)
{
	/*开启时钟*/
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE); //开启TIM2的时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE); // 开启对射式红外传感器DO 引脚 PA0的GPIOA外设时钟
	
	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU; // 外设的GPIO配置中 外部触发时钟输入引脚的推荐配置的浮空输入 江科大说上拉输入也可以
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStruct);
	
	/*第二步配置时钟源:选择时基单元的时钟为内部时钟*/
 //	TIM_InternalClockConfig(TIM2);		//选择TIM2为内部时钟，若不调用此函数，TIM默认也为内部时钟


	 /*第二步配置时钟源:把定时器配置为 外部时钟模式2（External Clock Mode 2），并且使用 ETR（外部触发输入引脚） 作为时钟源。*/
	 // 此时PA0引脚就成为TIM2的时钟源，因为TIM2 的 ETR 引脚，物理上就固定在 PA0 引脚上。
	 // 把定时器配置为 外部时钟模式2（External Clock Mode 2），并且使用 ETR（外部触发输入引脚） 作为时钟源。
	 // 配置的定时器实例为TIM2
	 // 不进行分频(TIM_ExtTRGPSC_OFF)
	 // 极性选择上升沿有效(TIM_ExtTRGPolarity_NonInverted)
	 // 滤波器为0X00(不用滤波器)
	 // 由于一直出现乱跳 根据弹幕的说法修改一下滤波 改成0X0F就可以了
	 TIM_ETRClockMode2Config(TIM2,TIM_ExtTRGPSC_OFF,TIM_ExtTRGPolarity_NonInverted, 0X0F);	
	
	// 第三步:配置时基单元
	/*时基单元初始化*/
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;				//定义结构体变量
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;		//时钟分频，选择不分频，此参数用于配置滤波器时钟，不影响时基单元功能
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;	//计数器模式，选择向上计数
	TIM_TimeBaseInitStructure.TIM_Period = 10 - 1;				//计数周期，即ARR的值 10
	TIM_TimeBaseInitStructure.TIM_Prescaler = 1 - 1;				//预分频器，即PSC的值 1
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;			//重复计数器，高级定时器才会用到
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);				//将结构体变量交给TIM_TimeBaseInit，配置TIM2的时基单元	
	
	/*中断输出配置*/
	TIM_ClearFlag(TIM2, TIM_FLAG_Update);						//清除定时器更新标志位
																//TIM_TimeBaseInit函数末尾，手动产生了更新事件
																//若不清除此标志位，则开启中断后，会立刻进入一次中断
																//如果不介意此问题，则不清除此标志位也可
	// 第四步:使能中断类型
	// 使能TIM2的更新中断
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);					//开启TIM2的更新中断
	
	// 第五步 NVIC
	// NVIC设置优先级分组
	// 设置优先级分组方案2
	/*NVIC中断分组*/
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);				//配置NVIC为分组2
																//即抢占优先级范围：0~3，响应优先级范围：0~3
																//此分组配置在整个工程中仅需调用一次
																//若有多个中断，可以把此代码放在main函数内，while循环之前
																//若调用多次配置分组的代码，则后执行的配置会覆盖先执行的配置
	
	/*NVIC配置*/
	NVIC_InitTypeDef NVIC_InitStructure;						//定义结构体变量
	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;				//选择配置NVIC的TIM2线
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;				//指定NVIC线路使能
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;	//指定NVIC线路的抢占优先级为2
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;			//指定NVIC线路的响应优先级为1
	NVIC_Init(&NVIC_InitStructure);								//将结构体变量交给NVIC_Init，配置NVIC外设
	
	// 第六步:最后一步:启动定时器
	// 使能TIM2定时器
	/*TIM使能*/
	TIM_Cmd(TIM2, ENABLE);			//使能TIM2，定时器开始运行
}

// 定时器中断函数，可以复制到使用它的地方
void TIM2_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
	{
		Num++;
		
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	}
}

